Repository: Jyothireddy-pula/BuiltFit
Catalog: lib/l10n/app_*.arb
Languages: pl

# language
source: English
pl: Polski

source: Home
pl: Start

source: Workout
pl: Trening

source: History
pl: Historia

source: Settings
pl: Ustawienia

source: Your Workouts
pl: Twoje treningi

# newWorkoutButtonTitle
source: New Workout
pl: Nowy trening

# newWorkoutButtonSubtitle
source: Create your next training plan
pl: Stwórz swój następny trening

# noWorkoutsTitle
source: You don't have any workouts yet
pl: Nie masz jeszcze żadnych treningów

# noWorkoutsSubtitle
source: Add your first training plan
pl: Dodaj swój pierwszy plan treningowy

# noHistoryTitle
source: No completed workouts yet
pl: Nie masz jeszcze odbytych treningów

# noHistorySubtitle
source: Complete a workout to see it here
pl: Odbądź trening, aby pojawił się tutaj

source: Home Page
pl: Strona główna

source: New Workout
pl: Nowy trening

source: Workout Name
pl: Nazwa treningu

source: Exercises
pl: Ćwiczenia

# dragExerciseHere
source: Drag exercises here
pl: Przeciągnij ćwiczenia tutaj

source: Available Exercises
pl: Dostępne ćwiczenia

source: Edit Sets
pl: Edytuj serie

source: Delete Exercise
pl: Usuń ćwiczenie

source: Move Up
pl: Przesuń w górę

source: Move Down
pl: Przesuń w dół

source: Remove Exercise
pl: Usuń ćwiczenie

# removeExerciseConfirmation
source: Are you sure you want to remove this exercise?
pl: Czy na pewno chcesz usunąć to ćwiczenie?

source: Remove
pl: Usuń

source: Cancel
pl: Anuluj

source: Edit Set
pl: Edytuj serię

source: Reps
pl: Powtórzenia

# weight
source: Weight (kg)
pl: Ciężar (kg)

source: Weight (lb)
pl: Ciężar (lb)

source: Save
pl: Zapisz

source: Add
pl: Dodaj

# workoutNameEmpty
source: Please enter a workout name
pl: Podaj nazwę treningu

# addOneExercise
source: Add at least one exercise
pl: Dodaj przynajmniej jedno ćwiczenie

# workoutCreated
source: Workout created successfully
pl: Trening został stworzony

source: Add Exercise
pl: Dodaj ćwiczenie

source: Exercise Name
pl: Nazwa ćwiczenia

# exerciseNameEmpty
source: Please enter exercise name
pl: Podaj nazwę ćwiczenia

# addOnePart
source: Add at least one body part
pl: Dodaj przynajmniej jedną część ciała

# exerciseAlreadyExists
source: An exercise with this name already exists
pl: Ćwiczenie o tej nazwie już istnieje

# workoutAlreadyExists
source: A workout with this name already exists
pl: Trening o takiej nazwie już istnieje

source: Workout Details
pl: Szczegóły treningu

source: Workout Stats
pl: Statystyki treningu

source: Sets
pl: Serie

# workoutDeleted
source: Workout deleted successfully
pl: Trening został usunięty

# removeWorkout
source: Delete Workout
pl: Usuń trening

# removeWorkoutConfirmation
source: Are you sure you want to delete this workout?
pl: Czy na pewno chcesz usunąć ten trening?

source: Weekly Plan
pl: Plan treningowy

# noWorkout
source: No workout [tap to add]
pl: Brak treningu [kliknij, aby dodać]

# noWorkoutsAvailable
source: No available workouts
pl: Brak dostępnych treningów

source: Choose Workout
pl: Wybierz trening

source: Clear Day
pl: Wyczyść dzień

# todayWorkout
source: Today's Workout:
pl: Dzisiejszy trening:

# startWorkout
source: Start
pl: Rozpocznij

source: No data
pl: Brak danych

# noDataSubtitle
source: Complete a workout to see stats!
pl: Zrób trening, by zobaczyć statystyki!

source: Your Stats
pl: Twoje statystyki

# mostFrequentDays
source: Most Frequent Training Days
pl: Najczęstsze dni treningowe

# mostWeight
source: Max total load in a single workout:
pl: Rekord całkowitego obciążenia na treningu:

# weightWeeklyProgress
source: Weekly Volume Progress
pl: Progres objętości tygodniowej

# favParts
source: Muscle Group Engagement
pl: Zaangażowanie partii

source: Prepare Workout
pl: Przygotuj trening

# configureRest
source: Configure rest time and start workout
pl: Skonfiguruj czas przerw i rozpocznij trening

# startWorkoutLong
source: Start Workout
pl: Rozpocznij trening

# setRest
source: Rest Between Sets
pl: Przerwa między seriami

# setRestAfter
source: Rest After Exercise
pl: Przerwa po ćwiczeniu

source: sec.
pl: sek.

source: Rest
pl: Przerwa

# restSubtitle
source: Rest and prepare for the next set
pl: Odpoczywaj i przygotuj się na kolejną serię

# restExerciseSubtitle
source: Rest and prepare for the next exercise
pl: Odpoczywaj i przygotuj się na kolejne ćwiczenie

source: Set
pl: Seria

# repsShort
source: reps
pl: powt.

source: Change Value
pl: Zmień wartość

# addSecs
source: 15 seconds
pl: 15 sekund

# endSet
source: Finish Set
pl: Zakończ serię

# terminateWorkout
source: Cancel Workout?
pl: Przerwać trening?

# finishWorkoutQuestion
source: Finish Workout?
pl: Zakończyć trening?

# terminateWorkoutSubtitle
source: Are you sure you want to cancel the workout? Progress will be lost.
pl: Czy na pewno chcesz przerwać trening? Postęp zostanie utracony.

# terminateWorkoutSubtitleShort
source: Are you sure you want to finish early?
pl: Czy na pewno chcesz zakończyć trening przedwcześnie?

source: Finish
pl: Zakończ

# terminate
source: Cancel
pl: Przerwij

source: Next Exercise
pl: Następne ćwiczenie

source: Pause
pl: Pauza

source: Resume
pl: Wznów

source: Workout Paused
pl: Trening wstrzymany

source: Finish Exercise
pl: Zakończ ćwiczenie

source: Finish Workout
pl: Zakończ trening

source: Summary
pl: Podsumowanie

source: Training Time
pl: Czas ćwiczenia

# volume
source: Volume (kg)
pl: Objętość (kg)

source: Volume (lb)
pl: Objętość (lb)

# workoutTime
source: Workout Duration
pl: Czas treningu

# volumePerExercise
source: Volume per Exercise (kg)
pl: Objętość na ćwiczenie (kg)

source: Volume per Exercise (lb)
pl: Objętość na ćwiczenie (lb)

source: Back to Home
pl: Powrót do strony głównej

# partsUsed
source: Targeted Muscle Groups
pl: Zaangażowane partie

# workoutWasAbandoned
source: Workout was ended before completion.
pl: Trening został przerwany przed końcem.

source: Completed
pl: Wykonano

# repeatWorkout
source: Repeat
pl: Powtórz

source: Workouts
pl: Treningi

# weightShort
source: Weight
pl: Ciężar

# newExerciseButton
source: Add Exercise
pl: Dodaj ćwiczenie

# newExerciseButtonSubtitle
source: Create a new exercise for your list
pl: Stwórz nowe ćwiczenie do listy ćwiczeń

# exerciseAdded
source: Exercise added successfully
pl: Ćwiczenie zostało dodane

# locale
source: en_US
pl: pl_PL

# exercisesLowercase
source: exercises
pl: ćwiczeń

source: General
pl: Ogólne

source: Training
pl: Trening

source: Data
pl: Dane

source: Info
pl: Informacje

source: Default rest between sets
pl: Domyślna przerwa między seriami

source: Default rest between exercises
pl: Domyślna przerwa między ćwiczeniami

source: seconds
pl: sekund

# chooseRest
source: Choose rest time
pl: Wybierz czas przerwy

# theme
source: Theme Mode
pl: Tryb motywu

source: Light
pl: Jasny

source: Dark
pl: Ciemny

source: System
pl: Systemowy

source: Choose Theme
pl: Wybierz motyw

# weightUnit
source: Weight Units
pl: Jednostki wagi

source: Choose Unit
pl: Wybierz jednostkę

# kgFull
source: Kilograms (kg)
pl: Kilogramy (kg)

# lbFull
source: Pounds (lb)
pl: Funty (lb)

source: Yes
pl: Tak

# resetDefaults
source: Reset to default settings?
pl: Przywrócić ustawienia domyślne?

# resetDefaultsSubtitle
source: All changes will be reverted.
pl: Wszystkie zmiany zostaną cofnięte.

# resetDefaultsTile
source: Reset to Defaults
pl: Przywróć domyślne ustawienia

source: Bench Press
pl: Wyciskanie na ławce

source: Deadlift
pl: Martwy ciąg

source: Squat
pl: Przysiad

# shoulderPress
source: Dumbbell Shoulder Press
pl: Wyciskanie hantli nad głowę

source: Bent-Over Row
pl: Wiosłowanie w opadzie

source: Pull-up
pl: Podciąganie

source: Push-up
pl: Pompki

source: Preacher Curl
pl: Uginanie ramion na modlitewniku

# legPressMachine
source: Leg Press
pl: Wypychanie ciężaru na suwnicy

# crunch
source: Crunches
pl: Brzuszki

source: Monday
pl: Poniedziałek

source: Tuesday
pl: Wtorek

source: Wednesday
pl: Środa

source: Thursday
pl: Czwartek

source: Friday
pl: Piątek

source: Saturday
pl: Sobota

source: Sunday
pl: Niedziela

source: Chest
pl: Klatka

source: Back
pl: Plecy

source: Legs
pl: Nogi

source: Arms
pl: Ramiona

source: Shoulders
pl: Barki

source: Abs
pl: Brzuch

source: Remove Set
pl: Usuń serię

# mondayShort
source: Mon
pl: Pn

# tuesdayShort
source: Tue
pl: Wt

# wednesdayShort
source: Wed
pl: Śr

# thursdayShort
source: Thu
pl: Cz

# fridayShort
source: Fri
pl: Pt

# saturdayShort
source: Sat
pl: Sb

# sundayShort
source: Sun
pl: Nd

source: Weeks
pl: Tygodni

source: Most
pl: Najwięcej

source: Last
pl: Ostatni

# defaultSetsExercises
source: Default sets and reps
pl: Domyślne serie i powtórzenia

# setsLowercase
source: sets
pl: serie

source: Set default values
pl: Ustaw domyślne wartości

# selectLanguage
source: Language
pl: Język

source: Clear all data
pl: Usuń wszystkie dane

# clearAllDataSubtitle
source: All workouts, history and settings will be permanently deleted.
pl: Wszystkie treningi, historia i ustawienia zostaną trwale usunięte.

# allDataCleared
source: All data has been cleared.
pl: Wszystkie dane zostały usunięte.

source: Export history
pl: Eksportuj historię

# historyExport
source: Workout history export
pl: Eksport historii treningów

# aboutApp
source: About the app
pl: O aplikacji

source: Barbell Curl
pl: Uginanie przedramion ze sztangą

source: Triceps Dips
pl: Pompki na poręczach

source: Leg Extension
pl: Prostowanie nóg na maszynie

source: Leg Curl
pl: Uginanie nóg na maszynie

source: Calf Raise
pl: Wspięcia na palce

source: Lat Pulldown
pl: Ściąganie drążka wyciągu górnego

source: Chest Fly
pl: Rozpiętki

source: Pec Deck
pl: Rozpiętki na maszynie

source: Hammer Curl
pl: Uginanie młotkowe

source: Skullcrusher
pl: Wyciskanie francuskie

source: Lateral Raise
pl: Unoszenie bokiem

source: Front Raise
pl: Unoszenie przodem

source: Plank
pl: Deska

source: Bicycle Crunch
pl: Brzuszki rowerowe

source: Mountain Climber
pl: Górski bieg

source: Russian Twist
pl: Skręty tułowia

source: Hip Thrust
pl: Wypychanie bioder

source: Face Pull
pl: Ściąganie linki do twarzy

# inclineBench
source: Incline Bench Press
pl: Wyciskanie na ławce skośnej

source: Reverse Lunge
pl: Wykroki w tył

source: Step-Up
pl: Wejścia na podest

source: Cable Crossover
pl: Rozpiętki na wyciągu

# shrug
source: Shoulder Shrug
pl: Szrugsy

source: Leg Press
pl: Wypychanie nóg

source: Glute Kickback
pl: Odwodzenie nogi w tył

source: Ab Wheel Rollout
pl: Brzuszki z kółkiem

# closeGripBench
source: Close-Grip Bench Press
pl: Wyciskanie wąskim chwytem

source: Decline Crunch
pl: Brzuszki na ławce skośnej

# farmerWalk
source: Farmerâ€™s Walk
pl: Spacer farmera

source: T-Bar Row
pl: Wiosłowanie T-bar
